In [111]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [112]:
table = pd.read_csv("table.csv")
table.head(5)

  Name  Score  Attempt
0    A    200        2
1    B    300        3
2    C     40        2

In [113]:
table.Attempt.sum()

7

In [114]:
table.loc[table.Attempt<=2]

  Name  Score  Attempt
0    A    200        2
2    C     40        2

In [115]:
table.count()

Name       3
Score      3
Attempt    3
dtype: int64

In [116]:
table.describe()

           Score   Attempt
count    3.00000  3.000000
mean   180.00000  2.333333
std    131.14877  0.577350
min     40.00000  2.000000
25%    120.00000  2.000000
50%    200.00000  2.000000
75%    250.00000  2.500000
max    300.00000  3.000000

In [117]:
table.loc[table.Score>200]

  Name  Score  Attempt
1    B    300        3

In [118]:
table = table.replace(table.Score)

In [119]:
table

  Name  Score  Attempt
0    A    200       40
1    B    300        3
2    C     40       40

In [120]:
table.Score[1:]

1    300
2     40
Name: Score, dtype: int64

In [121]:
table = table.replace(table.Score[1:])

In [122]:
table

  Name  Score  Attempt
0    A    200       40
1    B    300        3
2    C     40       40

In [123]:
table.at[1,'Score']='700'

In [124]:
table.Score

0    200
1    700
2     40
Name: Score, dtype: int64

In [125]:
table

  Name  Score  Attempt
0    A    200       40
1    B    700        3
2    C     40       40

In [126]:
table.Score.min()

40

In [127]:
table.Score.max()

700

In [128]:
table.Score.mean()/3

104.44444444444444

In [129]:
table

  Name  Score  Attempt
0    A    200       40
1    B    700        3
2    C     40       40

In [131]:

writer = pd.ExcelWriter('output2.xlsx')

table.to_excel('output2.xlsx')

writer.save()
print('DataFrame is written successfully to Excel File.')

DataFrame is written successfully to Excel File.